Tekla.Structures.Plugins.PluginAttribute
The PluginAttribute class is used for storing the name of the plug-in to the system.
The attribute is initialized from the custom attribute [Plugin("PluginName")] in the plug-in source.

Tekla.Structures.Plugins.PluginAttribute.#ctor(System.String)
The custom attribute [Plugin("PluginName")] uses this to store the name to the system.
This is not to be used by itself.
name: The name of the plug-in.

Tekla.Structures.Plugins.PluginAttribute.Name
The name of the plug-in in the system.